; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-13)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room4)
(at ball7 room4)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room5)
(at ball12 room6)
(at ball13 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room5)
(at ball2 room5)
(at ball3 room5)
(at ball4 room5)
(at ball5 room5)
(at ball6 room5)
(at ball7 room5)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room5)
(at ball12 room5)
(at ball13 room5)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 4 of 13
2. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 4 of 13
3. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 4 of 13
4. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 4 of 13
5. (drop ball1 room5 right)
   deleted: (carry ball1 right)
   added: (at ball1 room5) (free right)
   goals met: 5 of 13
6. (drop ball2 room5 left)
   deleted: (carry ball2 left)
   added: (at ball2 room5) (free left)
   goals met: 6 of 13
7. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 6 of 13
8. (pick ball13 room6 left)
   deleted: (at ball13 room6) (free left)
   added: (carry ball13 left)
   goals met: 6 of 13
9. (pick ball12 room6 right)
   deleted: (at ball12 room6) (free right)
   added: (carry ball12 right)
   goals met: 6 of 13
10. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 6 of 13
11. (drop ball12 room5 right)
   deleted: (carry ball12 right)
   added: (at ball12 room5) (free right)
   goals met: 7 of 13
12. (drop ball13 room5 left)
   deleted: (carry ball13 left)
   added: (at ball13 room5) (free left)
   goals met: 8 of 13
13. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 8 of 13
14. (pick ball7 room4 left)
   deleted: (at ball7 room4) (free left)
   added: (carry ball7 left)
   goals met: 8 of 13
15. (pick ball6 room4 right)
   deleted: (at ball6 room4) (free right)
   added: (carry ball6 right)
   goals met: 8 of 13
16. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 8 of 13
17. (drop ball6 room5 right)
   deleted: (carry ball6 right)
   added: (at ball6 room5) (free right)
   goals met: 9 of 13
18. (drop ball7 room5 left)
   deleted: (carry ball7 left)
   added: (at ball7 room5) (free left)
   goals met: 10 of 13
19. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 10 of 13
20. (pick ball5 room3 left)
   deleted: (at ball5 room3) (free left)
   added: (carry ball5 left)
   goals met: 10 of 13
21. (pick ball4 room3 right)
   deleted: (at ball4 room3) (free right)
   added: (carry ball4 right)
   goals met: 10 of 13
22. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 10 of 13
23. (drop ball4 room5 right)
   deleted: (carry ball4 right)
   added: (at ball4 room5) (free right)
   goals met: 11 of 13
24. (drop ball5 room5 left)
   deleted: (carry ball5 left)
   added: (at ball5 room5) (free left)
   goals met: 12 of 13
25. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 12 of 13
26. (pick ball3 room3 left)
   deleted: (at ball3 room3) (free left)
   added: (carry ball3 left)
   goals met: 12 of 13
27. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 12 of 13
28. (drop ball3 room5 left)
   deleted: (carry ball3 left)
   added: (at ball3 room5) (free left)
   goals met: 13 of 13
